alefragnani.bookmarks
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
eamodio.gitlens
llvm-vs-code-extensions.vscode-clangd
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.remote-explorer
pkief.material-icon-theme
shd101wyy.markdown-preview-enhanced
sumneko.lua
twxs.cmake
usernamehw.errorlens
vadimcn.vscode-lldb
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
